# Introduction to Missing Data

    null, None, NA, NaN, -1, ~

In [2]:
import numpy as np
import pandas as pd

In [7]:
vals1 = np.array([1, np.nan, 3, 4])
print(vals1.dtype)
vals1

float64

array([ 1., nan,  3.,  4.])

In [8]:
vals1.sum()

nan

In [9]:
1 + np.nan

nan

In [11]:
0 * np.nan

nan

In [14]:
np.nansum(vals1)

8.0

In [16]:
a = pd.Series([1, 2, None, 4, np.nan, 6])
a

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
5    6.0
dtype: float64

In [19]:
a.value_counts(dropna=False)

NaN    2
1.0    1
2.0    1
4.0    1
6.0    1
Name: count, dtype: int64

- isnull(): Generate a boolean mask indicating missing values
- notnull(): Opposite of isnull()
- dropna(): Return a filtered version of the data
- fillna(): Return a copy of the data with missing values filled or imputed

In [21]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [27]:
df[df[0].notnull()]

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5

In [31]:
df.dropna(axis="index")

     0    1  2
1  2.0  3.0  5

In [32]:
df.dropna(axis="columns")

   2
0  2
1  5
2  6

In [35]:
df.fillna(99)

      0     1  2
0   1.0  99.0  2
1   2.0   3.0  5
2  99.0   4.0  6

In [40]:
df.ffill(axis="columns")

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0